package com.company.timus;

import java.util.Scanner;

public class ABProblem {
    public static void main(String[] args) {
        Scanner console = new Scanner(System.in);

        int a = console.nextInt();
        int b = console.nextInt();

        System.out.println(a + b);
    }
}

/**
 * 1000. A+B Problem
 * Ограничение времени: 1.0 секунды
 * Ограничение памяти: 64 МБ
 * Вычислите a+b
 * Исходные данные
 * a и b
 * Результат
 * a+b
 */
